<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use App\Models\AccountType;

class AccountTypeSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::statement('SET FOREIGN_KEY_CHECKS=0;');
        DB::table('account_types')->truncate();
        DB::table('account_type_translations')->truncate();
        DB::statement('SET FOREIGN_KEY_CHECKS=1;');

        $types = [
            'الأصول',
            'الأصول غير المتداولة',
            'عقارات وآلات ومعدات',
            'أصول غير ملموسة',
            'أصول غير متداولة أخرى',
            'الأصول المتداولة',
            'النقدية ومافي حكمها',
            'عهد نقدية',
            'حساب البنك',
            'المدينون',
            'مصروفات مقدمة',
            'سلف موظفين',
            'المخزون',
            'مدينون وأرصدة مدينة أخرى',
            'الإلتزامات',
            'الإلتزامات المتداولة',
            'الدائنون',
            'مصاريف مستحقة',
            'الرواتب والمبالغ المستحقة للموظفين',
            'قروض قصيرة الأجل',
            'ضريبة القيمة المضافة المستحقة',
            'الضرائب المستحقة',
            'الإيرادات المقدمة',
            'إلتزامات متداولة أخرى',
            'مجمع الاهلاك',
            'أرصدة دائنة أخرى',
            'الإلتزامات غير المتادولة',
            'قروض طويلة الأجل',
            'حقوق الملاك',
            'رأس المال المصدر',
            'رأس المال',
            'رأس المال الإضافي المدفوع',
            'حقوق الملاك الأخرى',
            'حقوق ملكية أخرى',
            'الإحتياطيات',
            'أرباح/خسائر مبقاه',
            'الأرباح المبقاه (أو الخسائر)',
            'الإيرادات',
            'المبيعات',
            'الإيرادات الأخرى',
            'المصروفات',
            'التكلفة المباشرة',
            'تكلفة المبيعات',
            'تكاليف مباشرة أخرى',
            'مصاريف تشغيلية',
            'الرواتب',
            'مصاريف عمومية وإدارية',
            'مصاريف تسويقية',
            'مكافآت وحوافز',
            'مصاريف الإستهلاك',
            'تكاليف غير تشغيلية',
            'ضرائب',
            'ترجمة عملات أجنبية',
            'مصروف فوائد',
        ];

        foreach ($types as $key => $type) {
            AccountType::updateOrCreate([
                'id' => $key+1
            ],
            [
                'active' => 1,
                'ar' => [
                    'name' => $type,
                ]
            ]);
        }
    }
    
}
